# ESSENTIALS
base
base-devel
xorg
xorg-utils
xorg-server
xorg-xinit
xorg-xkb-layouts
xev
timeshift

# TERMINAL STUFF
vim
nano
feh
kitty
alacritty
btop
fastfetch
exa

# BLUETOOTH
bluez
bluez-utils
blueman
blueberry
blueberry-systray

# PACKAGE MANAGER
flatpak

# AUDIO
pipewire
pipewire-pulse
pavucontrol
pulseaudio
pulseaudio-module-bluetooth
pamixer
pulseaudio-equalizer
#alsa-utils
volumeicon

# NETWORK
network-manager
nm-applet
dhcpcd5
openvpn
nss-mdns
openvpn
wpasupplicant
samba
smbclient
nfs-utils
ufw
avahi
nss-mdns
cifs-utils
inetutils

# DEVELOPMENT
postgresql-libs
mariadb-libs
python
ruby
perl
lua
vscode
dotnet-sdk
nodejs
npm
cmake
meson
ninja
yasm
nasm
sqlite
meld
docker
nim

# SYSTEM
libx11
libxft
libxinerama
libxrandr
libxext
libxt
libgl
libxi
libxmu
gtk3
qt5-base
webkit2gtk
variety
unzip
xbindkeys
rofi
duf
wget
fontconfig
ttf-ms-win8-1
ttf-ms-win8-2
ttf-ms-win10-1
ttf-ms-win10-2
zed


# MEDIA
ffmpeg
gimp
mpv
vlc



























